package LeetCode.everyDay;

/**
 * 你有两种汤，A 和 B，每种初始为 n 毫升。在每一轮中，会随机选择以下四种服务操作中的一种，
 * 每种操作的概率为 0.25，且与之前的所有轮次 无关：
 * <p>
 * 从汤 A 取 100 毫升，从汤 B 取 0 毫升
 * 从汤 A 取 75 毫升，从汤 B 取 25 毫升
 * 从汤 A 取 50 毫升，从汤 B 取 50 毫升
 * 从汤 A 取 25 毫升，从汤 B 取 75 毫升
 * 注意：
 * <p>
 * 不存在先分配 100 ml 汤B 的操作。
 * 汤 A 和 B 在每次操作中同时被倒入。
 * 如果一次操作要求你倒出比剩余的汤更多的量，请倒出该汤剩余的所有部分。
 * 操作过程在任何回合中任一汤被用完后立即停止。
 * <p>
 * 返回汤 A 在 B 前耗尽的概率，加上两种汤在 同一回合 耗尽概率的一半。返回值在正确答案 10-5 的范围内将被认为是正确的。
 * <p>
 * <p>
 * <p>
 * 示例 1:
 * <p>
 * 输入：n = 50
 * 输出：0.62500
 * 解释：
 * 如果我们选择前两个操作，A 首先将变为空。
 * 对于第三个操作，A 和 B 会同时变为空。
 * 对于第四个操作，B 首先将变为空。
 * 所以 A 变为空的总概率加上 A 和 B 同时变为空的概率的一半是 0.25 *(1 + 1 + 0.5 + 0)= 0.625。
 */
public class SoupServings {
    public double soupServings(int n) {
        return 0d;
    }
}
